Repository: italia/spid-drupal-module
Catalog: translations/*.po
Languages: it

source: Invalid e-mail address @mail
it: L'indirizzo email @mail non è valido

source: Email address is not provided in SPID attribute.
it: L'indirizzo email non è presente tra gli attributi SPID

source: Service Provider configuration
it: Configurazione del Service Provider

source: Metadata URL
it: URL dei metadati

source: Assertion Consumer Service
it: URL del consumer delle asserzioni

source: Single Logout Service
it: URL del servizio di logout

source: Specifies the identifier to be used to represent the SP.
it: Specifica l'identificativo usato per rappresentare questo Service Provider.

source: Type of configuration to save for the certificates
it: Modalità di salvataggio dei certificati

source: Folder name
it: Nome della cartella

source: Cert/key value
it: Valore del certificato/chiave

source: x509 Certificate
it: Certificato x509

source: Public x509 certificate of the SP. No line breaks or BEGIN CERTIFICATE or END CERTIFICATE lines.
it: Il certificato x509 pubblico di questo Service Provider. Non inserire caratteri di a capo né le linee BEGIN CERTIFICATE o END CERTIFICATE.

source: Private Key
it: Chiave privata

source: Private key for SP. No line breaks or BEGIN CERTIFICATE or END CERTIFICATE lines.
it: Chiave privata di questo Service Provider. Non inserire caratteri di a capo né le linee BEGIN CERTIFICATE o END CERTIFICATE.

source: Certificate folder
it: Cartella del certificato

source: Set the path to the folder containing a /certs subfolder and the /certs/sp.key (private key) and /certs/sp.crt (public cert) files. The names of the subfolder and files are mandated by the external SPID Toolkit library.
it: Imposta il percorso della cartella contentente la sotto-cartella /certs e i file /certs/sp.key (la chiave privata) e /certs/sp.crt (il certificato pubblico). Il nome della sotto-cartella e dei file sono stabiliti dalla libreria SPID.

source: Required attributes
it: Arrtibuti richiesti

source: Choose which attributes we want returned from the Identity Provider. Notice that this list is used to populate the metadata, change this after that the metadata has been submitted to the different idp has no effect.
it: Scegli quali attributi devono essere ritornati dall'Identity Provider. Attenzione, questa lista è utilizzata per popolare il file con i metadati, modificare questa configurazione dopo che i metadati sono stati inviati agli Identity Provider non ha nessun effetto.

source: Identity Provider configuration
it: Configurazione degli Identity Provider

source: Enabled Identity Providers
it: Identity Provider abilitati

source: Choose which Identity providers to enable.
it: Scegli quali Identity Provider abilitare.

source: Test Identity Provider data
it: Dati per l'Identity Provider di test

source: The entity ID of the test Identity Provider.
it: Entity Id dell'Identity Provider di test.

source: Single sign-on service
it: Servizio di Single sign-on

source: The single sign-on url of the test Identity Provider.
it: L'URL di Single sign-on dell'Identity Provider di test.

source: Single logout service
it: Servizio di Single logout

source: The single logout url of the test Identity Provider.
it: L'URL di Single logout dell'Identity Provider di test.

source: The x509cert certificate of the test Identity Provider.
it: Il certificato x509 dell'Identity Provider di test.

source: User field mapping
it: Mapping dei campi utente

source: Security Options
it: Opzioni di sicurezza

source: Strict mode
it: Modalità strict

source: In strict mode, any validation failures or unsigned SPID messages which are requested to be signed (according to your settings) will cause the SPID conversation to be terminated. In production environments, this <em>must</em> be set.
it: Quando è abilitata la modalità strict qualsiasi fallimento nella validazione o qualsiasi messaggio SPID non firmato (quanto invece la firma è richiesta) causeranno la terminazione della conversazione SPID. In produzione <em>deve</em> essere abilitato.

source: Sign authentication requests
it: Firma le richieste di autenticazione

source: Requests sent to the Single sign-on Service of the Identity Provider will include a signature.
it: Le richieste inviate al servizio di Single sign-on dell'Identity Provider includeranno la firma.

source: Request messages to be signed
it: Firma i messaggi

source: Response messages from the Identity Provider are expected to be signed.
it: I messaggi di disposta dall'Identity Provider arrivano firmati.

source: SPID authentication level
it: Livello di autenticazione SPID

source: @name field is required.
it: Il campo @name è richiesto

source: The Certificate folder does not contain the required certs/sp.key or certs/sp.crt files.
it: La cartella dei certificati non contiene i file richiesti certs/sp.key e certs/sp.crt

source: Button size
it: Dimensione del bottone

source: Small
it: Piccolo

source: Medium
it: Medio

source: Large
it: Grande

source: Extra large
it: Molto grande

source: Fiscal number
it: Codice fiscale

source: Name
it: Nome

source: Family name
it: Cognome

source: Gender
it: Sesso

source: Id card
it: Documento d'identità

source: Expiration date
it: Data di scadenza

source: Date of birth
it: Data di nascita

source: Place of birth
it: Luogo di nascita

source: Country of birth
it: Paese di nascita

source: Digital address
it: Indirizzo digitale

source: Mobile phone
it: Telefono

source: Company name
it: Società

source: Registered office
it: Ufficio

source: Iva code
it: IVA

source: SPID code
it: Codice SPID

source: View service provider metadata
it: Vedi i metadata del Service Provider

source: Configure SPID authentication
it: Configura l'autenticazione SPID

source: SPID Authentication
it: Autenticazione SPID

source: Configure SPID authentication behaviors.
it: Configura l'autenticazione mediante SPID.

source: SPID Login
it: Login SPID

source: SPID Logout
it: Logout SPID

source: SPID Metadata
it: Metadati SPID

source: SPID ACS
it: ACS SPID

source: SPID SLS
it: SLS SPID

source: SPID login button
it: Bottone di login SPID
